    Pandas, Python programlama dili için yüksek performanslı, kullanımı kolay veri yapıları ve veri analizi araçları sağlayan, açık kaynaklı, BSD lisanslı bir kütüphanedir.
    Proje ana sayfası: https://pandas.pydata.org/

In [1]:
import pandas as pd

# Pandas ile Veri Okuma

In [2]:
# Okuyacağımız veriyi çalışma diznine taşırsak sadece veri dosyası ismi kullanmak yeterlidir.
# Bulunduğumuz çalışma diznini aşağıdaki kodlarla öğrenebiliriz.
import os
os.getcwd()

'D:\\OneDrive\\egitim\\verilen\\BlueMarkAcademy\\Tarim_Kredi_Kooperatifleri_Merkez_Birligi\\preprocessing-analysis-ml-dl-big-data\\02_pandas'

In [3]:
# VEri setini çalışma diznine taşımamış isek path belirtmek gerekir. 
# Ayrıca veri ayracının ne olduğu ve encodingin ne olduğuna da dikkat etmek gerekir (utf-8)
# Encoding Notepad++ üzerinden Encoding -> Convert to UTF8 veya notepad ile farklı kaydetme esnasında değiştirilebilir.

df = pd.read_csv("C:/Users/user/Desktop/egitim/Datasets/Mall_Customers.csv", sep=",")

In [4]:
df.head(10)

   CustomerID  Gender  Age  AnnualIncome  SpendingScore
0           1    Male   19         15000             39
1           2    Male   21         15000             81
2           3  Female   20         16000              6
3           4  Female   23         16000             77
4           5  Female   31         17000             40
5           6  Female   22         17000             76
6           7  Female   35         18000              6
7           8  Female   23         18000             94
8           9    Male   64         19000              3
9          10  Female   30         19000             72

# Pandas Dataframe Şekli, Boyutu

In [5]:
df.shape

(200, 5)

In [27]:
# Yukarıdaki bilgiden 15 satır 6 sütundan oluştuğunu anlıyoruz.

# Dataframe hakkında daha detaylı bilgi

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 5 columns):
CustomerID       200 non-null int64
Gender           200 non-null object
Age              200 non-null int64
AnnualIncome     200 non-null int64
SpendingScore    200 non-null int64
dtypes: int64(4), object(1)
memory usage: 7.9+ KB

In [7]:
df.describe()

       CustomerID         Age   AnnualIncome  SpendingScore
count  200.000000  200.000000     200.000000     200.000000
mean   100.500000   38.850000   60560.000000      50.200000
std     57.879185   13.969007   26264.721165      25.823522
min      1.000000   18.000000   15000.000000       1.000000
25%     50.750000   28.750000   41500.000000      34.750000
50%    100.500000   36.000000   61500.000000      50.000000
75%    150.250000   49.000000   78000.000000      73.000000
max    200.000000   70.000000  137000.000000      99.000000

# Okurken sütun seçmek, sep ve header

In [30]:
# sep="," niteliklerin birbirinden virgülile ayrılacaını söyler. Varsayılan virgüldür.
# Farklı bir ayraç için mutlaka bu parametre kullanılmalıdır.

In [8]:
df2 = pd.read_csv("C:/Users/user/Desktop/egitim/Datasets/Mall_Customers.csv",
                sep=",",
                header=0,
                usecols=["Gender","Age"])

In [9]:
df2.head()

   Gender  Age
0    Male   19
1    Male   21
2  Female   20
3  Female   23
4  Female   31

# Sütun İsimlerini Değiştirmek

In [10]:
df.columns

Index(['CustomerID', 'Gender', 'Age', 'AnnualIncome', 'SpendingScore'], dtype='object')

In [18]:
new_col_names = ['CUSTOMERID', 'GENDER', 'AGE', 'ANNUALINCOME', 'SPENDINGSCORE']
df.columns = new_col_names
df.head()

   CUSTOMERID  GENDER  AGE  ANNUALINCOME  SPENDINGSCORE
0           1    Male   19         15000             39
1           2    Male   21         15000             81
2           3  Female   20         16000              6
3           4  Female   23         16000             77
4           5  Female   31         17000             40

# Sütunları Seçmek

In [22]:
df['SPENDINGSCORE'].head()

0    39
1    81
2     6
3    77
4    40
Name: SPENDINGSCORE, dtype: int64

In [20]:
df.SPENDINGSCORE.head()

0    39
1    81
2     6
3    77
4    40
Name: SPENDINGSCORE, dtype: int64

#  Birden fazla sütunu seçmek (liste içinde seçmeyi unutmayın!!!)

In [24]:
df[['ANNUALINCOME','SPENDINGSCORE']].head()

   ANNUALINCOME  SPENDINGSCORE
0         15000             39
1         15000             81
2         16000              6
3         16000             77
4         17000             40

# Mevcut Bir Sutünun Değerlerini Değiştirmek

In [26]:
df['ANNUALINCOME'] = df.ANNUALINCOME / 1000

In [27]:
df.head()

   CUSTOMERID  GENDER  AGE  ANNUALINCOME  SPENDINGSCORE
0           1    Male   19          15.0             39
1           2    Male   21          15.0             81
2           3  Female   20          16.0              6
3           4  Female   23          16.0             77
4           5  Female   31          17.0             40

In [28]:
df['ANNUALINCOME'] = df.ANNUALINCOME * 1000

In [29]:
df.head()

   CUSTOMERID  GENDER  AGE  ANNUALINCOME  SPENDINGSCORE
0           1    Male   19       15000.0             39
1           2    Male   21       15000.0             81
2           3  Female   20       16000.0              6
3           4  Female   23       16000.0             77
4           5  Female   31       17000.0             40

# Yeni Sütun Eklemek

In [30]:
df['ANNUALINCOMETL'] = df.ANNUALINCOME * 6.0

In [31]:
df.head()

   CUSTOMERID  GENDER  AGE  ANNUALINCOME  SPENDINGSCORE  ANNUALINCOMETL
0           1    Male   19       15000.0             39         90000.0
1           2    Male   21       15000.0             81         90000.0
2           3  Female   20       16000.0              6         96000.0
3           4  Female   23       16000.0             77         96000.0
4           5  Female   31       17000.0             40        102000.0

In [32]:
df.shape

(200, 6)

# Kategorik Değişken Üreterek Yeni Sütun Yaratmak

In [33]:
# Yıllık 40K'dan küçükse low, 40K-100K arası middle, 100K üzeri high olsun

op_labels = ['low', 'middle', 'high']
category = [0,40000,100000,150000]
df['INCOMECAT'] = pd.cut(df['ANNUALINCOME'], labels=op_labels, bins=category, include_lowest=False)

In [35]:
df[df.ANNUALINCOME > 40000].head()

,CUSTOMERID,GENDER,AGE,ANNUALINCOME,SPENDINGSCORE,ANNUALINCOMETL,INCOMECAT
50,51,Female,49,42000.0,52,252000.0,middle
51,52,Male,33,42000.0,60,252000.0,middle
52,53,Female,31,43000.0,54,258000.0,middle
53,54,Male,59,43000.0,60,258000.0,middle
54,55,Female,50,43000.0,45,258000.0,middle

# Sütunları Birleştirmek

In [36]:
df['ANN-INCOMECAT'] = df['ANNUALINCOME'] + ' - ' + df['INCOMECAT']

TypeError: ufunc 'add' did not contain a loop with signature matching types dtype('<U32') dtype('<U32') dtype('<U32')

In [37]:
# int ile string birleşmez.
df['ANN-INCOMECAT'] = df['ANNUALINCOME'].astype(str) + ' - ' + df['INCOMECAT'].astype(str)

In [38]:
df.head()

,CUSTOMERID,GENDER,AGE,ANNUALINCOME,SPENDINGSCORE,ANNUALINCOMETL,INCOMECAT,ANN-INCOMECAT
0,1,Male,19,15000.0,39,90000.0,low,15000.0 - low
1,2,Male,21,15000.0,81,90000.0,low,15000.0 - low
2,3,Female,20,16000.0,6,96000.0,low,16000.0 - low
3,4,Female,23,16000.0,77,96000.0,low,16000.0 - low
4,5,Female,31,17000.0,40,102000.0,low,17000.0 - low

# Her satır için benzersiz bir id oluşturmak

In [39]:
# Kaç satır var?
df.count()

CUSTOMERID        200
GENDER            200
AGE               200
ANNUALINCOME      200
SPENDINGSCORE     200
ANNUALINCOMETL    200
INCOMECAT         200
ANN-INCOMECAT     200
dtype: int64

In [40]:
df['ID'] = range(0,200)
df.head()

,CUSTOMERID,GENDER,AGE,ANNUALINCOME,SPENDINGSCORE,ANNUALINCOMETL,INCOMECAT,ANN-INCOMECAT,ID
0,1,Male,19,15000.0,39,90000.0,low,15000.0 - low,0
1,2,Male,21,15000.0,81,90000.0,low,15000.0 - low,1
2,3,Female,20,16000.0,6,96000.0,low,16000.0 - low,2
3,4,Female,23,16000.0,77,96000.0,low,16000.0 - low,3
4,5,Female,31,17000.0,40,102000.0,low,17000.0 - low,4

# Sütunları Yeniden Adlandırmak

In [41]:
sutun_degisimi = {'ID':'ROWID'}
df.rename(columns=sutun_degisimi, inplace=True)
# inplace=True demek bu değişimi bellekte gerçekleştir.
# inplace=True işleminin geri dönüşü yoktur. Veriyi baştan okumak gerekir.

In [42]:
df.head()

,CUSTOMERID,GENDER,AGE,ANNUALINCOME,SPENDINGSCORE,ANNUALINCOMETL,INCOMECAT,ANN-INCOMECAT,ROWID
0,1,Male,19,15000.0,39,90000.0,low,15000.0 - low,0
1,2,Male,21,15000.0,81,90000.0,low,15000.0 - low,1
2,3,Female,20,16000.0,6,96000.0,low,16000.0 - low,2
3,4,Female,23,16000.0,77,96000.0,low,16000.0 - low,3
4,5,Female,31,17000.0,40,102000.0,low,17000.0 - low,4

# Sütunların Sırasını Değiştirmek

In [37]:
# ROWID'yi en başa almak istiyorum

In [43]:
df.columns

Index(['CUSTOMERID', 'GENDER', 'AGE', 'ANNUALINCOME', 'SPENDINGSCORE',
       'ANNUALINCOMETL', 'INCOMECAT', 'ANN-INCOMECAT', 'ROWID'],
      dtype='object')

In [44]:
df = df[['ROWID','CUSTOMERID', 'GENDER', 'AGE', 'ANNUALINCOME', 'SPENDINGSCORE',
       'ANNUALINCOMETL', 'INCOMECAT', 'ANN-INCOMECAT']]

In [45]:
df.head()

,ROWID,CUSTOMERID,GENDER,AGE,ANNUALINCOME,SPENDINGSCORE,ANNUALINCOMETL,INCOMECAT,ANN-INCOMECAT
0,0,1,Male,19,15000.0,39,90000.0,low,15000.0 - low
1,1,2,Male,21,15000.0,81,90000.0,low,15000.0 - low
2,2,3,Female,20,16000.0,6,96000.0,low,16000.0 - low
3,3,4,Female,23,16000.0,77,96000.0,low,16000.0 - low
4,4,5,Female,31,17000.0,40,102000.0,low,17000.0 - low

# Ödev

In [1]:
# simple_data.csv verisini kullanarak;

# 1. Sütun İsimlerini BÜYÜK HARFLİ yapınız
# 2. Yeni bir sütun içinde meslek,sehir sütunlarını aralarında çizgi olacak şekilde birleştiriniz.
# 3. aylik_gelir'i dolar cinsinden hesaplayarak aylik_gelir_dolar ismiyle yeni bir sütun ekleyiniz.
# 4. 3801'den başlayacak şekilde 3802, 3803... artarak her bir satıra id numarası veriniz (yeni bir sütun içinde)
# 5. aylik_geliri baz alarak 0-2500 arasını düşük, 2500-7500 arasını orta ve 7500 üstünü yüksek olacak şekilde 
#    kategorilendirip gelir_kategori ismiyle yeni bir sütun olarak ekleyiniz.